{"config": [{"config": {"use_bias": true, "trainable": true, "name": "conv2d_1", "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 45, 45, 1], "bias_regularizer": null, "data_format": "channels_last", "filters": 20, "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3], "padding": "valid", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_constraint": null, "dtype": "float32", "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"use_bias": true, "trainable": true, "name": "conv2d_2", "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 45, 45, 1], "bias_regularizer": null, "data_format": "channels_last", "filters": 20, "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3], "padding": "valid", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_constraint": null, "dtype": "float32", "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "max_pooling2d_1", "pool_size": [2, 2], "padding": "valid", "data_format": "channels_last", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "class_name": "Activation"}, {"config": {"use_bias": true, "trainable": true, "name": "conv2d_3", "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "data_format": "channels_last", "filters": 50, "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3], "padding": "valid", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_constraint": null, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"use_bias": true, "trainable": true, "name": "conv2d_4", "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "data_format": "channels_last", "filters": 50, "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3], "padding": "valid", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_constraint": null, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "max_pooling2d_2", "pool_size": [2, 2], "padding": "valid", "data_format": "channels_last", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_4"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"use_bias": true, "units": 16, "trainable": true, "name": "dense_1", "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_5"}, "class_name": "Activation"}, {"config": {"seed": null, "noise_shape": null, "trainable": true, "name": "dropout_1", "rate": 0.5}, "class_name": "Dropout"}, {"config": {"use_bias": true, "units": 32, "trainable": true, "name": "dense_2", "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_6"}, "class_name": "Activation"}, {"config": {"use_bias": true, "units": 2, "trainable": true, "name": "dense_3", "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"activation": "softmax", "trainable": true, "name": "activation_7"}, "class_name": "Activation"}], "keras_version": "2.1.2", "backend": "tensorflow", "class_name": "Sequential"}