{"keras_version": "2.1.2", "config": [{"config": {"data_format": "channels_last", "name": "conv2d_1", "dtype": "float32", "kernel_constraint": null, "activation": "linear", "batch_input_shape": [null, 45, 45, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_size": [3, 3], "bias_regularizer": null, "filters": 20, "kernel_regularizer": null, "bias_constraint": null, "padding": "valid", "trainable": false, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "name": "conv2d_2", "dtype": "float32", "kernel_constraint": null, "activation": "linear", "batch_input_shape": [null, 45, 45, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_size": [3, 3], "bias_regularizer": null, "filters": 20, "kernel_regularizer": null, "bias_constraint": null, "padding": "valid", "trainable": false, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"trainable": false, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "padding": "valid", "trainable": false, "data_format": "channels_last", "name": "max_pooling2d_1", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": false, "name": "activation_2", "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "conv2d_3", "kernel_constraint": null, "activation": "linear", "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_size": [3, 3], "bias_regularizer": null, "filters": 50, "kernel_regularizer": null, "bias_constraint": null, "padding": "valid", "trainable": false, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "conv2d_4", "kernel_constraint": null, "activation": "linear", "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_size": [3, 3], "bias_regularizer": null, "filters": 50, "kernel_regularizer": null, "bias_constraint": null, "padding": "valid", "trainable": false, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "padding": "valid", "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_2", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "activation_4", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"units": 100, "kernel_constraint": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "trainable": true, "name": "dense_1", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "act_1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_1", "seed": null, "rate": 0.5, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"units": 200, "kernel_constraint": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "trainable": true, "name": "dense_2", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "act_2", "activation": "relu"}, "class_name": "Activation"}, {"config": {"units": 2, "kernel_constraint": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "trainable": true, "name": "dense_3", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "softmax", "activation": "softmax"}, "class_name": "Activation"}], "backend": "tensorflow", "class_name": "Sequential"}